In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**Step-2: Create a DF using list**

In [2]:
names=['Ramesh','suresh','Sathish']
#pd.DataFrame(data,index,columns)
pd.DataFrame(names)

         0
0   Ramesh
1   suresh
2  Sathish

**Step-3: change the index**

In [3]:
names=['Ramesh','Suresh','Sathish']
ids=['A','B','C']
pd.DataFrame(names,ids)

         0
A   Ramesh
B   Suresh
C  Sathish

**Step-4:Add the columns**

In [6]:
names=['Ramesh','Suresh','Sathish']
ids=['A','B','C']
col=['Names']
pd.DataFrame(names,ids,col)

     Names
A   Ramesh
B   Suresh
C  Sathish

**Step-5:Data and columns**

In [8]:
names=['Ramesh','Suresh','Sathish']
col=['Names']
pd.DataFrame(names,columns=col)

     Names
0   Ramesh
1   Suresh
2  Sathish

**Step-6: multiple columns**

In [7]:
names=['Ramesh','Suresh','Sathish']
age=[20,22,24]
col=['Names','Age']
df=pd.DataFrame(zip(names,age),columns=col)
df

     Names  Age
0   Ramesh   20
1   Suresh   22
2  Sathish   24

**Step-7: add a new column to aready existed frame**

- in above first we have taken data 

- the created adata frame

- now we want to add new data based on the requirement

In [8]:
city=['Hyd','Pune','Bengalore']
df['city']=city
df

     Names  Age       city
0   Ramesh   20        Hyd
1   Suresh   22       Pune
2  Sathish   24  Bengalore

In [15]:
marks=[59,48]
df['marks']=marks

ValueError: Length of values (2) does not match length of index (3)

In [9]:
df['marks']=[20,30,40]
df

     Names  Age       city  marks
0   Ramesh   20        Hyd     20
1   Suresh   22       Pune     30
2  Sathish   24  Bengalore     40

**Step-8: update he column with new values**

In [19]:
df

     Names  Age       city  marks
0   Ramesh   20        Hyd     20
1   Suresh   22       Pune     30
2  Sathish   24  Bengalore     40

In [21]:
df['marks']

0    20
1    30
2    40
Name: marks, dtype: int64

In [23]:
df['marks']=[200,300,400]
df

     Names  Age       city  marks
0   Ramesh   20        Hyd    200
1   Suresh   22       Pune    300
2  Sathish   24  Bengalore    400

**Step-9: create empty data frameand add the columns**

In [24]:
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [26]:
df['Names']=['Ramesh','Suresh','Sathish']
df['Age']=[20,22,24]
df['City']=['Hyd','Pune','Blr']
df['Marks']=[100,200,300]
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd    100
1   Suresh   22  Pune    200
2  Sathish   24   Blr    300

**step-10: create data frame using dictionary**

In [27]:
d={'Names':['Ramesh','Suresh','Sathish'],
   'Age':[20,22,24],
   'City':['Hyd','Pune','Blr']}
df=pd.DataFrame(d)
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [28]:
d={'Names':'Ramesh',
   'Age':20,
   'City':'Hyd'}
df=pd.DataFrame(d)
df

ValueError: If using all scalar values, you must pass an index

In [30]:
d={'Names':'Ramesh',
   'Age':20,
   'City':'Hyd'}
df=pd.DataFrame(d,index=[0])
df

    Names  Age City
0  Ramesh   20  Hyd

**Step-11: saving the data frame**

In [10]:
df.to_csv('data.csv')

In [12]:
df.to_excel('data.xlsx')

In [13]:
df.to_html('data.html')

**Step-12: how to read the data frame**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# in order to read the data
# filename.ext
#open(mbox.short.txt).read()
#open(dummy.txt,mode='w').write('hello')

#data.csv  data.xlsx

In [11]:
pd.read_csv('data.csv')

   Unnamed: 0    Names  Age       city  marks
0           0   Ramesh   20        Hyd     20
1           1   Suresh   22       Pune     30
2           2  Sathish   24  Bengalore     40

In [15]:
pd.read_excel('data.xlsx')

   Unnamed: 0    Names  Age       city  marks
0           0   Ramesh   20        Hyd     20
1           1   Suresh   22       Pune     30
2           2  Sathish   24  Bengalore     40

In [16]:
d={'Names':['Ramesh','Suresh','Sathish'],
   'Age':[20,22,24],
   'City':['Hyd','Pune','Blr']}
df=pd.DataFrame(d)
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [18]:
df.to_csv('data1.csv',index=False)

In [19]:
pd.read_csv('data1.csv')

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [20]:
df.to_excel('data1.xlsx',index=False)

In [22]:
pd.read_excel('data1.xlsx')

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [24]:
df['Marks']=[100,200,300]
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd    100
1   Suresh   22  Pune    200
2  Sathish   24   Blr    300

**step-13: drop the column**

- labels

- axis

- index

- columns

- inplace

In [25]:
df.drop

<bound method DataFrame.drop of      Names  Age  City  Marks
0   Ramesh   20   Hyd    100
1   Suresh   22  Pune    200
2  Sathish   24   Blr    300>

In [26]:
df.drop(index=1)

     Names  Age City  Marks
0   Ramesh   20  Hyd    100
2  Sathish   24  Blr    300

In [30]:
df.drop(columns='Marks')

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [31]:
df.drop(columns=['City','Marks'])

     Names  Age
0   Ramesh   20
1   Suresh   22
2  Sathish   24

In [32]:
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd    100
1   Suresh   22  Pune    200
2  Sathish   24   Blr    300

In [36]:
df.drop('Marks') # if argument not given label error
df.drop(1) # 1 becomes label error

KeyError: "['Marks'] not found in axis"

In [37]:
df.drop("Marks",axis=1) # default axis=0

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

**Inplace**

- when we do the operation the result output is not overwriting

- means he original dataframe is same as it is

- in order to this we need to use **Inplace**

- by default inplace=False

- make **inplace=True** if you want overwrite theresult

In [44]:
df.drop('Marks',axis=1,inplace=True)
df

KeyError: "['Marks'] not found in axis"

**step-14: Rename the column**

In [42]:
d={'City':'city'}
df.rename(d,axis=1,inplace=True)
df

     Names  Age  city  Marks
0   Ramesh   20   Hyd    100
1   Suresh   22  Pune    200
2  Sathish   24   Blr    300

In [45]:
d={2:'B'}
df.rename(d,axis=0,inplace=True)
df

     Names  Age  city
0   Ramesh   20   Hyd
1   Suresh   22  Pune
B  Sathish   24   Blr

In [50]:
x=list(range(1,11))
y=[i*i for i in x]
z=[i**3 for i in x]
df=pd.DataFrame(zip(x,y,z),columns=['X','Y','Z'])
df

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

- len

- df.shape

- df.size

- df.isnull

- df.head

- df.tail

- df.dtype

- df.info

In [51]:
len(df)

10

In [52]:
df.shape

(10, 3)

In [54]:
df.size

30

In [65]:
df.head()

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125

In [66]:
df.tail()

    X    Y     Z
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [67]:
df.isnull()

       X      Y      Z
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       10 non-null     int64
 1   Y       10 non-null     int64
 2   Z       10 non-null     int64
dtypes: int64(3)
memory usage: 368.0 bytes

In [71]:
df.dtypes

X    int64
Y    int64
Z    int64
dtype: object

**step-15: select a column**

In [72]:
df.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [73]:
df['X']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: X, dtype: int64

In [75]:
df[['X','Y']]

    X    Y
0   1    1
1   2    4
2   3    9
3   4   16
4   5   25
5   6   36
6   7   49
7   8   64
8   9   81
9  10  100

In [76]:
type(df['X'])

pandas.core.series.Series

In [78]:
type(df[['X','Y']])

pandas.core.frame.DataFrame

In [79]:
df['Z']

0       1
1       8
2      27
3      64
4     125
5     216
6     343
7     512
8     729
9    1000
Name: Z, dtype: int64

In [80]:
df[['X','Y','Z']]

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [81]:
type(df[['X','Y','Z']])

pandas.core.frame.DataFrame

In [82]:
df['X'].shape

(10,)

In [83]:
df[['X','Y']].shape

(10, 2)

In [92]:
df # dataframe

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [88]:
df['Z'] # selecting one particular column

0       1
1       8
2      27
3      64
4     125
5     216
6     343
7     512
8     729
9    1000
Name: Z, dtype: int64

In [90]:
df['Z'].values # extracting the data

array([   1,    8,   27,   64,  125,  216,  343,  512,  729, 1000],
      dtype=int64)

In [91]:
df['Z'].values.tolist()

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

In [93]:
df # dataframe
df['Z'] # selecting one particular column
df['Z'].values # extracting the data
df['Z'].values.tolist()

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]